#include<stdio.h>
#include<stdlib.h>
#include<conio.h>
int main(void){
	printf("~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*\n");   //個人風格畫面 
	printf("||名子:李維濬               ||\n");
	printf("------------------------------\n");
	printf("||班級:E1B                  ||\n");
	printf("------------------------------\n");
	printf("||座號:38                   ||\n");
	printf("------------------------------\n");
	printf("||興趣:跳舞、打籃球、踢足球 ||\n");
	printf("------------------------------\n");
	printf("||最喜歡科目:數學           ||\n");
	printf("------------------------------\n");
	printf("||居住地:桃園               ||\n");
	printf("------------------------------\n");
	printf("||想學的:魔術、寫程式、投資 ||\n");
	printf("------------------------------\n");
	printf("!!    以上是我的個人資料    !!\n"); 
	printf("*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~\n");
	system("pause");        //暫停程式 按任一鍵繼續 
	system("cls");          //按任一鍵清除 
	
	int a=0,p;                  //設定整數變數 ,密碼輸入次數 
	while(a<3){
	printf("請輸入4個數字的密碼:");
	scanf("%d",&p);         //輸入密碼
	if(p==2024){            //檢查密碼對不對 
		system("cls");      //按任一鍵清除
		printf("~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*\n");   //個人風格表格 
		printf("------------------------------\n");
		printf("||a. 畫出直角三角形         ||\n");
		printf("------------------------------\n");
		printf("||b. 顯示乘法表             ||\n");
		printf("------------------------------\n");
		printf("||c. 結束                   ||\n");
		printf("------------------------------\n");
		printf("*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~\n");
		return 0;
	}else{
		a++;
		printf("密碼錯誤!! 您還有 %d 次嘗試機會\n", 3-a);
		} 
}
		
	
	
	system("pause");
	return 0;
		}
		 
